wmo_codes = {
        0: " Ясно",
        1: " Преимущественно ясно",
        2: " Переменная облачность",
        3: " Пасмурно",
        45: " Туман",
        48: " Изморозь (отлагающийся туман)",
        51: " Легкая морось",
        53: " Умеренная морось",
        55: " Плотная морось",
        56: " Легкий ледяной дождь",
        57: " Плотный ледяной дождь",
        61: " Слабый дождь",
        63: " Умеренный дождь",
        65: " Сильный дождь",
        66: " Слабый ледяной дождь",
        67: " Сильный ледяной дождь",
        71: " Слабый снегопад",
        73: " Умеренный снегопад",
        75: " Сильный снегопад",
        77: " Снежные зерна",
        80: " Слабый ливневый дождь",
        81: " Умеренный ливневый дождь",
        82: " Сильный ливневый дождь",
        85: " Слабый ливневый снегопад",
        86: " Сильный ливневый снегопад",
        95: " Гроза (слабая или умеренная)",
        96: " Гроза со слабым градом",
        99: " Гроза с сильным градом"
    }

def return_w_codes():
    return wmo_codes